Tescripts/k6-tests-new/thushajini-test/Exp_A_04.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: Exp_A_04.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 50 looping VUs for 10m0s (gracefulStop: 30s)

WARN[0275] The test has generated metrics with 100070 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details.  component=metrics-engine-ingester
WARN[0511] The test has generated metrics with 200042 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details.  component=metrics-engine-ingester


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<800' p(95)=222.58ms

    http_req_failed
    ✗ 'rate<0.01' rate=50.50%


  █ TOTAL RESULTS 

    checks_total.......: 54676  90.97748/s
    checks_succeeded...: 73.68% 40288 out of 54676
    checks_failed......: 26.31% 14388 out of 54676

    ✗ status is 200
      ↳  49% — ✓ 13531 / ✗ 13807
    ✗ response time < 800 ms
      ↳  97% — ✓ 26757 / ✗ 581

    HTTP
    http_req_duration..............: avg=97.06ms min=504.49µs med=8.63ms  max=17.32s p(90)=63.96ms p(95)=222.58ms
      { expected_response:true }...: avg=41.42ms min=763.8µs  med=10.72ms max=2.39s  p(90)=41.9ms  p(95)=101.88ms
    http_req_failed................: 50.50% 13807 out of 27338
    http_reqs......................: 27338  45.48874/s

    EXECUTION
    iteration_duration.............: avg=1.09s   min=1s       med=1s      max=18.34s p(90)=1.06s   p(95)=1.22s   
    iterations.....................: 27338  45.48874/s
    vus............................: 50     min=50             max=50
    vus_max........................: 50     min=50             max=50

    NETWORK
    data_received..................: 8.3 MB 14 kB/s
    data_sent......................: 9.4 MB 16 kB/s



running (10m01.0s), 00/50 VUs, 27338 complete and 0 interrupted iterations
default ✓ [======================================] 50 VUs  10m0s
ERRO[0602] thresholds on metrics 'http_req_failed' have been crossed